In [30]:
from sqlalchemy import create_engine, text
from sqlalchemy.orm import sessionmaker
import pandas as pd

# データベースへの接続設定
DATABASE_URI = 'mysql+mysqlconnector://root:password@localhost/lesson'
engine = create_engine(DATABASE_URI)

# CREATE TABLE books

In [7]:
with engine.connect() as connection:
    create_table_query = """
    CREATE TABLE books
    (book_id CHAR(5) PRIMARY KEY,
     title VARCHAR(100) NOT NULL,
     cat_id CHAR(3),
     author VARCHAR(50),
     date DATE,
     price INT,
     stock INT)
    """
    connection.execute(text(create_table_query))
    print("Table created successfully")

Table created successfully

# DESC books;

In [39]:
with engine.connect() as connection:
    desc_table_query = "DESC books"
    result = connection.execute(text(desc_table_query))
    
    # 結果を表示
    df_desc_books = pd.DataFrame(result.fetchall(), columns=result.keys())
df_desc_books

     Field          Type Null  Key Default Extra
0  book_id       char(5)   NO  PRI    None
1    title  varchar(100)   NO         None
2   cat_id       char(3)  YES         None
3   author   varchar(50)  YES         None
4     date          date  YES         None
5    price           int  YES         None
6    stock           int  YES         None

In [26]:
with engine.connect() as conn:
    # トランザクションを明示的に表示する
    trans = conn.begin()
    
    # 例外処理を加える
    try:
        books_insert_query = """
        INSERT INTO books VALUES('B1001', 'たのしく学ぶSQLコマンド', 'C01', '鈴木正男', '2001-05-03', 1800, 120)
        """

        conn.execute(text(books_insert_query))
        trans.commit()
    except Exception as e:
        # エラー発生時のロールバック
        trans.rollback()
        print(f"Error: {e}")

Error: (mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry 'B1001' for key 'books.PRIMARY'
[SQL:
        INSERT INTO books VALUES('B1001', 'たのしく学ぶSQLコマンド', 'C01', '鈴木正男', '2001-05-03', 1800, 120)
        ]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

# INSERT INTO books

In [40]:
# データベースに接続してINSERT文を実行
with engine.connect() as conn:
    # トランザクションを開始
    trans = conn.begin()
    try:
        books_insert_query = """
        INSERT INTO books (book_id, title, cat_id, author, date, price, stock) VALUES
        ('B1001', 'たのしく学ぶSQLコマンド', 'C01', '鈴木正男', '2001-05-03', 1800, 120)
        ('B1002', 'はじめてのDB設計', 'C01', '鈴木正子', '2001-10-21', 2000, 88),
        ('B1003', 'ウォーキングをはじめよう', 'C05', '高橋孝子', '2002-09-05', 980, 15),
        ('B1004', 'ネットワーク構築入門', 'C01', '山田和夫', '2004-08-04', 2200, 56),
        ('B1005', '成功する人の108の習慣', 'C02', '高橋太郎', '2008-03-03', 1500, 2),
        ('B1006', 'おてがるレシピ', 'C05', '佐藤茂夫', '2012-04-11', 880, 66),
        ('B1007', 'みきむら先生の基本情報技術教本', 'C03', '三木村健', '2016-08-24', 1800, 32),
        ('B1008', 'Computer Networks', 'C01', 'Robert Smith', '2018-05-05', 2100, 25),
        ('B1009', 'SQL Handbook', 'C01', 'John Doe', '2021-12-01', 2600, 43),
        ('B1010', '風景画を描いてみよう', NULL, '田中十郎', NULL, 1500, NULL);
        """
        conn.execute(text(books_insert_query))
        
        # コミット
        trans.commit()
    except Exception as e:
        # エラー発生時にロールバック
        trans.rollback()
        print(f"Error: {e}")

Error: (mysql.connector.errors.ProgrammingError) 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '('B1002', 'はじめてのDB設計', 'C01', '鈴木正子', '2001-10-21', 2000, ' at line 3
[SQL:
        INSERT INTO books (book_id, title, cat_id, author, date, price, stock) VALUES
        ('B1001', 'たのしく学ぶSQLコマンド', 'C01', '鈴木正男', '2001-05-03', 1800, 120)
        ('B1002', 'はじめてのDB設計', 'C01', '鈴木正子', '2001-10-21', 2000, 88),
        ('B1003', 'ウォーキングをはじめよう', 'C05', '高橋孝子', '2002-09-05', 980, 15),
        ('B1004', 'ネットワーク構築入門', 'C01', '山田和夫', '2004-08-04', 2200, 56),
        ('B1005', '成功する人の108の習慣', 'C02', '高橋太郎', '2008-03-03', 1500, 2),
        ('B1006', 'おてがるレシピ', 'C05', '佐藤茂夫', '2012-04-11', 880, 66),
        ('B1007', 'みきむら先生の基本情報技術教本', 'C03', '三木村健', '2016-08-24', 1800, 32),
        ('B1008', 'Computer Networks', 'C01', 'Robert Smith', '2018-05-05', 2100, 25),
        ('B1009', 'SQL Handbook', 'C01', 'John Doe', '2021-12-01', 2600, 43),
        ('B1010', '風景画を描いてみよう', NULL, '田中十郎', NULL, 1500, NULL);
        ]
(Background on this error at: https://sqlalche.me/e/20/f405)

# booksテーブルの確認

In [41]:
with engine.connect() as conn:
    books_select_query = """
    SELECT * FROM books
    """
    result = conn.execute(text(books_select_query))
    df_books_select = pd.DataFrame(result.fetchall(), columns=result.keys())

df_books_select

  book_id              title cat_id        author        date  price  stock
0   B1001      たのしく学ぶSQLコマンド    C01          鈴木正男  2001-05-03   1800  120.0
1   B1002          はじめてのDB設計    C01          鈴木正子  2001-10-21   2000   88.0
2   B1003       ウォーキングをはじめよう    C05          高橋孝子  2002-09-05    980   15.0
3   B1004         ネットワーク構築入門    C01          山田和夫  2004-08-04   2200   56.0
4   B1005       成功する人の108の習慣    C02          高橋太郎  2008-03-03   1500    2.0
5   B1006            おてがるレシピ    C05          佐藤茂夫  2012-04-11    880   66.0
6   B1007    みきむら先生の基本情報技術教本    C03          三木村健  2016-08-24   1800   32.0
7   B1008  Computer Networks    C01  Robert Smith  2018-05-05   2100   25.0
8   B1009       SQL Handbook    C01      John Doe  2021-12-01   2600   43.0
9   B1010         風景画を描いてみよう   None          田中十郎        None   1500    NaN

# CREATE TABLE category

In [35]:
with engine.connect() as connection:
    create_table_query = """
    CREATE TABLE category
    (cat_id CHAR(5) PRIMARY KEY,
     cat_name VARCHAR(30) NOT NULL
    )
    """
    connection.execute(text(create_table_query))
    print("Table created successfully")

Table created successfully

# DESC category;

In [37]:
with engine.connect() as connection:
    desc_table_query = "DESC category"
    result = connection.execute(text(desc_table_query))
    print(f"resultの方は{type(result)}です。")
    # 結果を表示
    df_desc_cat = pd.DataFrame(result.fetchall(), columns=result.keys())
df_desc_cat

resultの方は<class 'sqlalchemy.engine.cursor.CursorResult'>です。

      Field         Type Null  Key Default Extra
0    cat_id      char(5)   NO  PRI    None
1  cat_name  varchar(30)   NO         None

# INSERT INTO category

In [43]:
# データベースに接続してINSERT文を実行
with engine.connect() as conn:
    # トランザクションを開始
    trans = conn.begin()
    try:
        category_insert_query = """
        INSERT INTO category VALUES
        ('C01', 'コンピューター・IT'),
        ('C02', 'ビジネス'),
        ('C03', '就職・資格'),
        ('C04', '文芸'),
        ('C05', '暮らし・健康')
        """
        conn.execute(text(category_insert_query))
        
        # コミット
        trans.commit()
    except Exception as e:
        # エラー発生時にロールバック
        trans.rollback()
        print(f"Error: {e}")

# categoryの確認

In [47]:
with engine.connect() as conn:
    books_select_query = """
    SELECT * FROM category;
    """
    result = conn.execute(text(books_select_query))
    df_cat_select = pd.DataFrame(result.fetchall(), columns=result.keys())

df_cat_select

  cat_id    cat_name
0    C01  コンピューター・IT
1    C02        ビジネス
2    C03       就職・資格
3    C04          文芸
4    C05      暮らし・健康

# CREATE TABLE books2

In [45]:
with engine.connect() as connection:
    create_table_query = """
    CREATE TABLE books2
    (book_id CHAR(5) PRIMARY KEY,
     title VARCHAR(100) NOT NULL,
     cat_id CHAR(3),
     author VARCHAR(50),
     date DATE,
     price INT,
     stock INT)
    """
    connection.execute(text(create_table_query))
    print("Table created successfully")

Table created successfully

# INSERT INTO books2

In [52]:
# データベースに接続してINSERT文を実行
with engine.connect() as conn:
    # トランザクションを開始
    trans = conn.begin()
    try:
        books2_insert_query = """
        INSERT INTO books2 (book_id, title, cat_id, author, date, price, stock) VALUES
        ('B1101', 'いちか日記', 'C04', '一条いちか', '2012-07-08', 1400, 50),
        ('B1102', 'ココアを飲みながら', 'C04', '二ノ瀬秀治', '2016-09-15', 1600, 66),
        ('B1103', '冬の嘘とリップクリーム', 'C04', '三ツ谷光雄', '2021-03-03', 1200, 120)
        """
        conn.execute(text(books2_insert_query))
        
        # コミット
        trans.commit()
    except Exception as e:
        # エラー発生時にロールバック
        trans.rollback()
        print(f"Error: {e}")

# books2の確認

In [53]:
with engine.connect() as conn:
    books_select_query = """
    SELECT * FROM books2;
    """
    result = conn.execute(text(books_select_query))
    df_books2_select = pd.DataFrame(result.fetchall(), columns=result.keys())

df_books2_select

  book_id        title cat_id author        date  price  stock
0   B1101        いちか日記    C04  一条いちか  2012-07-08   1400     50
1   B1102    ココアを飲みながら    C04  二ノ瀬秀治  2016-09-15   1600     66
2   B1103  冬の嘘とリップクリーム    C04  三ツ谷光雄  2021-03-03   1200    120